//Написать калькулятор, который считает выражение по введенной строке. 
//Например пользователь вводит (2+3)*3 + 7 - 9(1 + 1) одной строкой. 
//И калькулятор выдает ответ 4. Калькулятор должен знать сложение, умножение, деление, вычитание и работать с дробными числами.

//Задание со звездочкой: добавить в калькулятор возможность вычисление синусов, косинусов, корней, и возведение в степень.

//Задание с двумя звездочками: если пользователь ввел выражение с ошибкой или с неправильным символом,
//то калькулятор должен указать на каком символе ошибка.
